const str = `
xswap用户协议
公布日期：2019年  月  日                                                       生效日期：2019年  月  日
目录：
总则
用户条款内容
用户注册
xswap服务与服务费用
xswap服务使用规范
特别授权
责任范围与责任限制
风险提示
协议终止
隐私权政策
法律适用、管辖与其他
xswap是一家基于数字货币的永续合约交易平台，由Pristine Limited于塞舌尔共和国全资设立，Pristine Limited是一家根据塞舌尔共和国法律组建的公司。
名词定义：
数字资产：指基于区块链技术、以电子数据形式存在的一种虚拟货币资产，典型的代表如比特币、以太坊等。
钱包：指用于保管数字资产的电子钱包。
保证金：是指用户在参与xswap平台进行掉期交易时，用户所需缴纳的数字资产。
xswap交易：是一种点对点的合约交易，指用户相互之间使用数字资产作为保证金而参与的以金融市场主流货币对、商品、指数等交易品种价格作为指标的永不到期合约（Perpetual Swap）。

一、总则
1.1为明确双方的权利和义务，规范双方行为，xswap（以下简称“xswap”）与xswap网站、移动客户端使用人（以下简称“用户”）本着平等互利的原则，就用户使用xswap旗下的xswap网站事项达成《xswap用户协议》(以下简称本协议)。本协议具有合同效力，用户勾选“我同意接受协议”并按下“注册并同意协议”按钮的行为视为签署本协议，用户签署本协议后，本协议即构成对双方有约束力的法律文件，xswap不引用本协议相关条款或者不行使条款规定的权利并不构成对相关条款以及权利的放弃。
1.2用户理解并确认，在正式签署本协议之前，已对协议全文进行阅读并同意按照协议的约定使用xswap的产品，用户尤其应当注意粗体标注的内容。
1.3限制注册条款：
如果用户是位于以下国家/地区的公民或居民，在以下国家/地区设立或以其他方式成立，则不得访问或使用xswap平台：
美国、加拿大魁北克省、古巴、克里米亚和塞瓦斯托波尔、伊朗、叙利亚，朝鲜以及苏丹；
xswap服务已被明确禁止或违反当地法律或法规的其它国家/地区。 
xswap有权以各种措施以限制在任何受限制司法管辖区内访问本服务或交易平台。 如xswap认定用户正在从上述国家/地区访问、使用xswap服务，或用户在注册与完成KYC手续时提供了关于注册地、国藉、居住地的虚假陈述，xswap有权自主决定立即关闭用户的全部账户与强制平仓用户全部未平仓仓位。
二、用户条款内容
2.1本协议内容包括协议正文及所有xswap已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，xswap网站提供的服务均受本协议约束。
2.2用户应当在使用xswap网站服务与移动客户端服务之前认真阅读全部协议内容。如用户对协议有任何疑问，应向xswap网站咨询。但无论用户事实上是否在使用xswap网站服务与移动客户端服务之前认真阅读了本协议内容，只要用户使用xswap网站服务与移动客户端服务，则本协议即对用户产生约束，届时用户不能以未阅读本协议的内容或者未获得xswap网站对用户问询的解答等理由，主张本协议无效，或要求撤销本协议。
2.3用户承诺接受并遵守本协议的约定。如果用户违反本协议约定的内容，用户应立即停止注册程序或停止使用xswap网站服务与移动客户端服务。
2.4xswap网站有权根据需要不时地制订、修改本协议及各类规则，xswap对于用户的通知及任何其他的协议、告示或其他关于用户使用会员账户及服务的通知，用户同意xswap可通过网站及移动客户端内的公告、站内信、电子邮件、手机短信、无线通讯装置等电子方式或邮寄等物理方式进行，该等通知于发送之日视为已送达收件人 （如以邮寄方式向会员发出通知的，则在该等通知按照用户在xswap留存的联系地址交邮后的第三个自然日即视为送达）。因不可归责于xswap的原因（包括电子邮件地址、手机号码、联系地址等不准确或无效、信息传输故障等）导致用户未在前述通知视为送达之日收到该等通知的，xswap不承担任何责任。
如用户不同意相关变更内容，应当提出并立即停止使用xswap网站服务与移动客户端服务。用户继续使用xswap网站服务与移动客户端服务的，即表示用户对修改的协议无异议并接受。 
2.5除非本协议条款另有约定，本协议项下的各个文件相互冲突或者不一致，应当以下述顺序来决定文件的效力以解决冲突或者不一致：
（一）xswap用户协议；
（二）xswap风险提示书；
（三）xswap隐私政策；
（四）xswap反欺诈、反洗钱条款；
（五）其他协议、规则和指引。
2.6用户可以选择使用xswap的不同语言版本，若存在xswap的不同语言版本之内容不一致或者相冲突，或遗漏内容之情形，xswap网站与移动客户端内的中文文本应当优先适用。
三、用户注册
3.1注册者资格：在用户完成注册程序或以其他xswap允许的方式实际使用xswap网站服务与移动客户端服务时，用户应当是年满二十一周岁、具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若用户不具备前述主体资格，则用户及用户的监护人应承担因此而导致的一切后果，且xswap有权注销（永久冻结）用户的xswap网站账户，并向用户及用户的监护人索偿。
3.2账户：在用户签署本协议，完成会员注册程序或以其他xswap所允许的方式实际使用xswap网站服务与移动客户端服务时，xswap网站为用户提供唯一编号的xswap网站账户（以下亦称账户）。
账户设置会员名和密码，通过该会员名密码或与该会员名密码关联的其它用户名密码登陆xswap网站。用户设置的会员名不得侵犯或涉嫌侵犯他人合法权益。当用户的账户设立完成后，用户应当在此后90日内使用用户的会员名和密码登陆xswap网站。逾期未登录的，xswap有权终止向用户提供xswap网站服务与移动客户端服务，注销用户的账户。账户注销后，相应的会员名将开放给任意用户注册登记使用。
用户应对用户的账户（会员名）和密码的安全，以及对通过用户的账户（会员名）和密码实施的行为负责。除非有法律规定或司法裁定，且征得xswap网站的同意，否则，账户（会员名）和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。如果发现任何人不当使用用户的账户或有任何其他可能危及用户的账户安全的情形时，用户应当立即以有效方式通知xswap网站，要求xswap网站暂停相关服务。请用户理解xswap网站对用户的请求采取相应措施，在采取措施前已经产生的后果（包括但不限于用户的任何损失）不承担任何责任。
3.3会员：在用户按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后或以其他xswap允许的方式实际使用xswap网站服务与移动客户端服务时，用户即成为xswap网站会员（亦称会员）。在注册时，用户应当按照法律法规要求，或注册页面的提示准确提供，并及时更新用户的资料，以使之真实、及时，完整和准确。如有合理理由怀疑用户提供的资料错误、不实、过时或不完整的，xswap有权向用户发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对用户提供部分或全部xswap网站服务与移动客户端服务。xswap对此不承担任何责任，用户将承担因此产生的任何直接或间接支出。用户应当准确填写并及时更新用户提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便xswap或其他会员与用户进行有效联系，因通过这些联系方式无法与用户取得联系，导致用户在使用xswap网站服务与移动客户端服务过程中产生任何损失或增加费用的，应由用户完全独自承担。
3.4用户在使用xswap网站服务与移动客户端服务过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面的费用，均由用户独自承担。 
四、xswap服务与服务费用
4.1xswap是一家提供以数字资产为保证金，以货币对、商品期货、股票指数等品种价格为指标的永续合约交易平台。买卖双方在我们平台上直接进行点对点交易，xswap作为平台提供商在这些交易中既不是买方也不是卖方。用户可以在xswap转入、提取其数字资产，但须遵守本协议的限制。用户可以在swap内托管钱包中查询其数字资产。
xswap为用户提供以下交易服务： 
可以让您用一种类型的数字资产作为保证金，参与交易主流外汇货币对、商品、指数等市场品种价格为指标的永续合约。您将无法预先确定或与预先确定的用户进行交易。同样的，一个合约可能部分完成或由来自不同用户的多个匹配合约完成的。 
数字钱包（充币和提币）：用户可以将数字资产从其他地址转入xswap合作的数字资产托管方分配给用户的账户指定地址，或将该地址的数字资产转出至用户指定的其他钱包地址。xswap将视作以您的名义要求数字资产托管方保管该数字资产，并且应当承认您是您数字钱包中任何数字资产的收益所有人。除非经过您的合法指示和事先授权，xswap不会将您的数字资产用作证券或以任何方式使用您的数字资产。xswap代表您保管的数字资产可能会和其他用户的数字资产存放在一起。
通过同意本条款，您明确表示同意您的数字资产与其他用户的数字资产存放在一起。个人用户的权益不会因单独的物权凭证或其他电子记录而可以辨认，在存在不可避免的亏损的情况中，您可能无法收到您的全部利润并且可能按比例平摊亏损。您声明并保证，您将一直保持是委托xswap代为持有的任何数字资产的最终的有效合法收益所有人，您不会担任任何其他人的代名人或受托人，并且不会在没有xswap的事先书面同意的情况下转移、过户、抵押、收费或以其他任何方式在相关数字资产上创设任何担保物权或产权负担。 
除了4.1条项下所列之服务，xswap不能就xswap交易提供给用户任何投资、法律、税收或其他专业意见，且任何平台所提供之任何消息、探讨、分析、价格等信息均为一般评论，不够成对用户进行任何交易的建议。如果用户需要专业意见，用户应当向相关专业人事咨询交易有关的投资、法律、税收或其他专业性建议。xswap不承担用户因依赖上述一般评论而产生的任何直接或间接而产生的损失（包括任何利润损失）。
4.2xswap提供的服务不应当理解为或被用于向任何认定xswap所提供之服务为非法的国家或地区的用户发出要约。
4.3用户了解并同意，在使用xswap交易时可能面临缺口风险（gap risk），即xswap平台内各类合约的价格由于突发的重大事件、意外事件、不可抗力等情况而导致市场发生瞬间重大变化。由于xswap交易永续合约的特性，用户的xswap合约交易中当前交易对手平仓后至匹配到新交易对手时，且xswap无法向爆仓或穿仓用户追偿该笔交易而产生的债务，因此可能会导致用户的实际盈利少于其合约预期盈利。
4.4用户了解并同意，xswap有权应政府部门（包括司法及行政部门）的要求，向其提供用户在xswap网站填写的注册信息和交易记录等必要信息。如用户涉嫌侵犯他人人身权益或者危害公共利益及国家安全，则xswap亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人或监管机构提供用户必要的身份信息。 
4.5服务费用
用户承认并同意，通过使用本服务，xswap将向用户收取服务费用。
服务费用标准在以下网站内列出：https://www.xswap.io/faq 。
Xswap有权随时自行修改、调整平台内各项服务费用收费标准。
如用户不同意服务费用收费标准的修订，应当立即停止使用xswap网站服务与移动客户端服务。用户继续使用xswap网站服务与移动客户端服务的，即表示用户对修改的服务费用收费标准无异议并接受。
五、服务使用规范
5.1在xswap网站与移动客户端上使用xswap服务过程中，用户承诺遵守以下约定：
（一）用户在使用xswap网站服务与移动客户端服务过程中实施的所有行为均遵守其国籍所属国家法律、法规等规范性文件及xswap网站各项规则的规定和要求，不损害他人的合法权益，不违反本协议及相关规则。用户如果违反前述承诺，产生任何法律后果的，用户应以自己的名义独立承担所有的法律责任，并确保xswap免于因此产生任何损失。
（二）用户必须依xswap要求提示提供真实、最新、有效及完整的资料，用户有义务维持并更新会员的资料，确保其为真实、最新、有效及完整。
（三）用户保证并承诺通过xswap作为保证金参与交易的一切数字资产和资金来源皆合法。
（四）用户应同意将不会利用xswap网站、移动客户端的服务进行任何违法或不正当的活动，包括但不限于下列行为：
（1）用户不得上载、展示、张贴、传播或以其它方式传送含有下列内容之一的信息： 1)危害xswap及用户国籍所属国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；损害国家荣誉和利益的； 2)散布谣言，扰乱社会秩序，破坏社会稳定的； 3)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； 4)侮辱或者诽谤他人，侵害他人合法权利的； 5)含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容； 6)在未经过xswap授权的情况下发布商业广告的； 7)含有法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。
（2）用户不得利用xswap网站、移动客户端从事以下活动： 1)未经允许，进入计算机信息网络或者使用计算机信息网络资源的； 2)未经允许，对计算机信息网络功能进行删除、修改或者增加的； 3)未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的； 4)故意制作、传播计算机病毒等破坏性程序的； 5)未经允许，使用任何装置、软件或例行程序干预或试图干预xswap网站、移动客户端的正常运作或正在xswap网站、移动客户端上进行的任何交易、活动； 6)未经允许，采取任何将导致不合理的庞大数据负载加诸xswap网站网络设备的行动。
7)其他危害计算机信息网络安全的行为。
（3）用户应保证不对xswap网站上的任何数据作商业性利用，包括但不限于在未经xswap事先书面同意的情况下，以复制、传播等任何方式使用xswap网站站上展示的资料。 xswap网站的所有内容，包括著作、图片、档案、资讯、资料、平台架构、平台画面的安排、平台设计，文字和图表，软件编译，相关源代码和软件等均由平台或其他权利人依法拥有其知识产权，包括商标权、专利权、著作权、商业秘密等都受到知识产权法的保护（另有说明的除外）。非经xswap或其他权利人书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表平台程序或内容。
本协议任何条款都不构成对于任何著作权以及知识产权的使用授权。
5.2用户了解并同意：
xswap有权对用户是否违反上述5.1条及本协议之承诺做出单方认定，并根据单方认定结果适用规则予以处理或终止向用户提供服务，且无须征得用户的同意或提前通知予用户。
经xswap根据自身的判断，认为用户的行为涉嫌违反本协议和/或规则的条款或涉嫌违反法律法规的规定的，则xswap有权在xswap网站上公示用户涉嫌违法或违约行为及xswap已对用户采取的措施。
经xswap根据自身的判断，对于用户在xswap网站上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议和/或规则的信息，xswap有权不经通知用户即予以删除，且按照规则的规定进行处罚。
对于用户在xswap网站上实施的行为，包括用户未在xswap网站上实施但已经对xswap网站及其用户产生影响的行为，xswap有权单方认定用户行为的性质及是否构成对本协议和/或规则的违反，并据此作出相应处罚。用户应自行保存与用户行为有关的全部证据，并应对无法提供充分证据而承担相应的责任。
对于用户涉嫌违反承诺的行为对任意第三方造成损害的，用户均应当以自己的名义独立承担所有的法律责任，并应确保xswap免于因此产生损失或增加费用。 
如用户涉嫌违反有关法律或者本协议之规定，使xswap遭受任何损失，或受到任何第三方的索赔，或受到任何监管机构的处罚，用户应当赔偿xswap因此造成的损失及（或）发生的费用，包括合理的律师费用。
5.3xswap发现用户不适合进行交易情形时，有权终止或终止用户对会员账户之使用。
5.4用户系自愿注册成为平台会员，xswap没有强迫、诱导、欺骗或者通过其他不公平的手段对用户施加影响。
六、特别授权
用户完全理解并不可撤销地授予xswap及其合作公司或个人下列权利：
 一旦用户向xswap及（或）其合作公司或个人作出任何形式的承诺，且相关公司已确认用户违反了该承诺，则xswap有权立即按用户的承诺或协议约定的方式对用户的账户采取限制措施，包括中止或终止向用户提供服务，并公示相关公司确认的用户的违约情况。用户了解并同意，xswap无须就相关确认与用户核对事实，或另行征得用户的同意，且xswap无须就此限制措施或公示行为向用户承担任何的责任。 
对于用户提供的资料及数据信息，用户授予xswap及其合作公司或个人独家的、全球通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)。此外，xswap及其合作公司有权(全部或部份地) 使用、复制、修订、改写、发布、翻译、分发、执行和展示用户的全部资料数据（包括但不限于注册资料、累积全部交易数据及全部展示于xswap网站的各类信息）或制作其派生作品，并以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。
七、责任范围和责任限制
7.1xswap对其提供的全部服务不作任何明示或暗示的保证，包括但不限于xswap网站服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，xswap也不对xswap网站服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性作出任何承诺和保证。
7.2服务中断或故障
会员同意，基于互联网的特殊性，xswap不担保服务不会中断，也不担保服务的及时性和/或安全性。系统因相关状况无法正常运作，使会员无法使用任何xswap平台服务或使用任何xswap平台服务时受到任何影响时，xswap对会员或第三方不负任何责任，前述状况包括：
(一) xswap平台系统停机维护期间。
(二) 电信设备出现故障不能进行数据传输的。
(三) 由于黑客攻击、网络供应商技术调整或故障、网站升级的问题等原因而造成的xswap平台服务中断或延迟。
(四) 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成xswap平台系统障碍不能执行业务的。
7.3除非法律法规明确要求，或出现以下情况，否则，xswap没有义务对所有用户的注册数据、交易行为以及与交易有关的其它事项进行事先审查： （一）xswap有合理的理由认为特定会员及具体交易事项可能存在重大违法或违约情形。
（二）xswap有合理的理由认为用户在xswap网站的行为涉嫌违法或不当。
7.4xswap的赔偿豁免范围：
用户了解并同意，xswap不对因下述任一情况而导致用户的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿 (无论xswap是否已被告知该等损害赔偿的可能性) ：  (一) 用户的收入损失；
(二) 用户的交易盈利或合同损失；
(三) xswap服务中断、中止或终止而引起的损失；
(四)用户所持有的数字资产（主流加密货币、稳定币）价格波动，加密货币、稳定币发行方倒闭或其他原因导致其所持有的数字资产贬值损失；
(五)xswap平台及其自有的数字资产钱包遭受黑客攻击而导致的数字资产损失；
(六)xswap合作的数字资产钱包托管方倒闭或其钱包被黑客攻击而产生的损失；
(七) 信息传递问题而造成的损失；
(八) 用户错失交易机会的损失；
(九) 商誉或声誉的损失；
(十) 数据的遗失或损坏而造成的损失；
(十一) 任何由于侵权（包括故意和过失）、违约、或其他任何原因导致的间接的、特殊的或附带性的损失，不论此种损失是否为xswap所能合理预见，亦不论xswap是否事先被告知存在此种损失的可能性。
7.5不可抗力事件：
（一）xswap可以在合理范围内,确定一个不可抗力事件的存在。不可抗力事件包括但不限于以下条款：
（1） 不论在何种情况下，xswap均不对由于互联网正常的设备维护，互联网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，金融市场危机，自然灾害，爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。
（2）由于相关价格指标供应商或主要的数字资产托管人,分托管人,或监管原因而产生的任何差错，由其承担责任并履行义务。
（3）当市场出现不正常的波动时，包括xswap认为已产生或快要产生波动的时候，可以关闭交易；
（二）若因某个不可抗力事件的存在,xswap可以在没有通知用户的前提下,在任何时候以一个或多个步骤进行以下合理行动：
（1）改变用户的保证金要求,这可能导致用户被要求提供额外的保证金;
（2）当xswap有证据认为是合适的收盘价时，将相关用户的持仓平仓;
（3）在某种程度上不可行或因不可抗力事件导致xswap无法正常运行的情况下，暂停或修改应用程序的全部或部分的用户协议;
（4）为某个特定交易修改交易时间；
（5）若在极端环境下发生难以想象的状况，而使市场处于极度不稳定的状态下，xswap有权将用户的持仓平仓。
7.6xswap秉承专业尽责的服务理念为用户提供服务，一旦出现由于xswap的原因造成服务产品出现瑕疵，xswap网站仅在用户针对该次服务所支付的服务费用承担赔偿责任。
除本协议另有规定外，在任何情况下，xswap对本协议所承担的违约赔偿责任总额不超过向用户收取的当笔数字资产交易平台服务费用总额。
7.7xswap并没有审核过通过xswap链接至的所有网站。这些网站可能包含某些信息资料部分用户会觉得不适当或者具有冒犯性。xswap对于任何网站发布的任何内容、广告、产品或者其他资料都没有进行过认可，也不对其负有任何责任。xswap网站与移动客户端包含的链接并不表示xswap对链接至的网站进行过认可，xswap提供这些其他网站的链接，仅出于为用户的方便考虑。用户通过xswap网站与第三方主体进行的交易包括支付该第三方主体提供的货物及服务的行为，仅在用户和该第三方主体之间产生法律关系。对于用户通过xswap网站与第三方主体发生交易而产生的任何损失，用户将同意xswap对此不承担任何责任。
7.8xswap会允许其他公司（“第三方广告服务”或者“广告网络联盟”，下简称“广告商”）合作在xswap网站页面上发布广告。其中有些广告商也许会在用户的电脑上植入持续性的缓存文件。这使得广告商能识别用户的电脑并向用户有针对性地投送在线广告。所有的电脑都能够拒绝接受缓存文件，这可以通过对浏览器进行相应的设置来实现，但请注意如果用户拒绝接受缓存文件，用户可能无法使用xswap网站的某些功能。xswap对广告商植入用户电脑的缓存文件并不具有控制权, 因此也对广告商因投放广告对用户造成的损害不承担责任。
八、 风险提示
用户了解并认可，任何通过xswap进行的交易并不能避免以下风险的产生，xswap不能也没有义务为如下风险负责：
宏观经济风险：由于全球宏观经济形势的变化以及周边国家、地区宏观经济环境和周边市场的变化，可能会引起xswap交易市场的波动，使用户存在保证金亏损的可能，用户将不得不承担由此造成的差额损失。
政策风险：有关xswap交易市场的法律、法规及相关政策、规则发生变化，可能引起xswap交易市场价格波动，使用户存在保证金亏损的可能，用户将不得不承担由此造成的差额损失。
技术风险：由于交易撮合及行情揭示是通过电子通讯技术和电脑技术来实现的，这些技术存在着被网络黑客和计算机病毒攻击的可能，由此可能给用户带来损失。抑或是一些情况的发生可能使平台不能执行订单或重复执行订单，或使您不能进入交易平台等的系统错误和网络链接问题。任何通过网络交易发生的通信故障、失真或延误，还有以上所述的种种技术或不可抗拒之因素的风险，均将由用户自身承担。
不可抗力因素导致的风险：诸如地震、火灾、水灾、战争等不可抗力因素可能导致xswap交易系统的瘫痪；xswap无法控制和不可预测的系统故障、设备故障、通讯故障、电力故障等也可能导致xswap交易系统非正常运行甚至瘫痪，这些都会使用户的交易委托无法成交或者无法全部成交，用户将不得不承担由此导致的损失。
数字资产市场风险：
（1）数字资产本身不由任何金融机构或平台发行，数字资产市场是全新的、未经确认的，且可能不会带来实际收益增长的市场；
（2）数字资产市场崩溃；
（3）用户的数字资产钱包私钥失密、用户的数字资产钱包被黑客攻击或被第三方盗窃；
（4）用户所持有的数字资产遭受算力攻击而导致资产数额变动等；
（5）用户在转入/转出数字资产时填写错误的地址或未进行转账备注而导致的数字资产遗失；
（6）用户在买卖数字资产前未履行审慎义务导致其银行账号被监管机构冻结、查封；
（7）用户所持有的数字资产发行方倒闭而导致用户持有的数字资产贬值、归零。
其他风险：
由于用户的过错导致的任何损失，包括：密码失密、操作不当、交易决策失误、遗忘或泄露密码、密码被他人破解、用户使用的计算机系统被第三方侵入、用户委托第三人代理交易时第三人恶意或不当操作而造成的损失等原因可能会使用户发生账户保证金亏损，该损失将由用户自行承担；
在用户进行交易中他人给予用户的保证获利或不会发生账户保证金亏损的任何承诺都是没有根据的，类似的承诺不会减少用户发生账户保证金亏损的可能。
网上交易、热键操作完毕，未及时退出，他人进行恶意操作而造成的损失；其中xswap交易未及时退出还可能遭遇黑客攻击，从而造成损失。
xswap交易市场有极高风险，并不适合绝大部分人士参与交易。用户知悉并了解此投资有可能导致部分损失或全部损失，所以用户应当以能承受的损失程度来决定其投入的保证金额度。除了本协议第八条提示的风险外，还会有未能预测的风险存在。用户应慎重评估自己的财政状况，及各项风险，而做出任何xswap交易的决定。用户应当承担由该决定产生的全部损失，xswap对用户的交易决定不承担任何责任。
九、协议终止
9.1用户同意，xswap有权自行全权决定以任何理由不经事先通知的中止、终止向用户提供部分或全部xswap网站与移动客户端服务，暂时冻结或永久冻结（注销）用户的xswap网站账户，且无须为此向用户或任何第三方承担任何责任。
9.2出现以下情况时，xswap有权直接以注销账户的方式终止本协议:  （一） xswap终止向用户提供服务后，用户涉嫌再一次直接或间接或以他人名义注册为xswap网站用户的； 
用户提供的电子邮箱不存在或无法接收电子邮件，且没有其他方式可以与用户进行联系，或xswap网站以其它联系方式通知用户更改电子邮件信息，而用户在xswap网站通知后三个工作日内仍未更改为有效的电子邮箱的。
用户注册信息中的主要内容不真实或不准确或不及时或不完整。
本协议（含规则）变更时，用户明示并通知xswap不愿接受新的服务协议的；
xswap认为其它应当终止服务的情况。
9.3用户有权向xswap网站要求注销用户的账户，经xswap网站审核同意的，xswap网站注销（永久冻结）用户的账户，届时，用户与xswap基于本协议的合同关系即终止。用户的账户被注销（永久冻结）后，xswap没有义务为用户保留或向用户披露用户账户中的任何信息，也没有义务向用户或第三方转发任何用户未曾阅读或发送过的信息。 
9.4用户同意，用户与xswap合同关系终止后，xswap仍享有下列权利： （一） 继续保存用户的注册信息及用户使用xswap网站服务期间的所有交易信息。
（二）用户在使用xswap网站与移动客户端服务期间存在违法行为或违反本协议和/或规则的行为的，xswap仍可依据本协议向用户主张权利。 
9.5xswap中止或终止向用户提供xswap网站与移动客户端服务后，对于用户在服务中止或终止之前的交易行为依下列原则处理，用户应独立处理并完全承担进行以下处理所产生的任何争议、损失或增加的任何费用，并应确保xswap免于因此产生任何损失或承担任何费用。   用户在服务中止或终止之前已经上传至xswap网站的订单尚未交易的，xswap有权在中止或终止服务的同时删除此项订单的相关信息。
十、隐私权政策
10.1xswap有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
10.2xswap可能会与第三方合作向用户提供服务，如该第三方同意承担与xswap同等的保护用户隐私的责任，则xswap有权将用户的相关信息等提供给该第三方。
10.3用户所提交的信息将存储在xswap网站的服务器中。信息通过互联网传输并不是完全安全的，xswap不能保证用户通过互联网上传给xswap的数据的安全性，因此该数据传输所产生的风险将完全由用户自己承担。当xswap分配给用户（或者由用户设置）一组密码来浏览网站的特定内容，该密码的保密性将由用户自己负责。 
10.4xswap将在xswap网站公布并不时修订隐私权相关条款，隐私权的规定构成本协议的有效组成部分。有关xswap隐私政策的更多相信信息，请参阅以下网页内的隐私政策：https://www.xswap.io/privacypolicy 。
十一、法律适用、管辖与其他
11.1本协议之效力、解释、变更、执行与争议解决均适用塞舌尔法律的约束和解释。
11.2您同意您根据本条款所提起的任何法律诉讼将仅在xswap注册所在地的法院提出，并且您在此不可撤销地无条件同意并接受上述法院对由这些条款引起的任何诉讼或争议的专属管辖权。
11.3如本协议中的任何条款被任何有管辖权的机构认定为不可执行的，无效的或非法的，并不影响本协议的其余条款的效力。
11.4对违约行为的豁免，或本协议任一条款的放弃，仅在守约方或非寻求放弃方书面签字同意豁免后方能生效。任何本协议项下的违约豁免，不能认定或解释为守约方对其后再次违约或其他违约行为的豁免；未行使任何权利或救济不得以任何方式被解释为对该等权利或救济的放弃。
11.5本协议自用户获得本网站账号时生效，对协议双方具有约束力。



附件1：
风险提示书
公布日期：2019年  月  日                                                       生效日期：2019年  月  日

一、数字资产市场与xswap交易有风险，参与需谨慎。
数字资产本身不由任何金融机构或公司或本网站发行。
数字资产市场是全新的、未经确认的，而且可能不会增长。
使用数字资产作为保证金交易有极高风险，在参与xswap交易时，可能会获得较高的收益，但同时也存在着较大的风险。xswap交易涉及相当高的风险，因而未必适合所有用户。
您必须考量到您的交易目标、经验程度，以及个人所能承受的风险，您了解和理解数字资产会产生衍生风险，若有疑问即可向独立的财务顾问询问专业意见。
二、您承诺并知晓：
您已年满二十一周岁，且具有完全民事行为能力。
您有可能面对保证金损失部分或所有账户数字资产余额，而当中的损失有可能超过您的全部数字资产。若您的所有账户数字资产全部损失，您承诺并保证仍然有能力在经济、日常生活等其他方面承担所有风险。
因此，建议您不要冒险交易自己预算以外的数字资产。
三、相关风险如下：
（一）宏观经济风险：由于全球宏观经济形势的变化以及周边国家、地区宏观经济环境和周边市场的变化，可能会引起xswap交易市场的波动，使用户存在保证金亏损的可能，用户将不得不承担由此造成的差额损失。
（二）政策风险：有关xswap交易市场的法律、法规及相关政策、规则发生变化，可能引起xswap交易市场价格波动，使用户存在保证金亏损的可能，用户将不得不承担由此造成的差额损失。
（三）技术风险：由于交易撮合及行情揭示是通过电子通讯技术和电脑技术来实现的，这些技术存在着被网络黑客和计算机病毒攻击的可能，由此可能给用户带来损失。抑或是一些情况的发生可能使平台不能执行订单或重复执行订单，或使您不能进入交易平台等的系统错误和网络链接问题。任何通过网络交易发生的通信故障、失真或延误，还有以上所述的种种技术或不可抗拒之因素的风险，均将由用户自身承担。
（四）不可抗力因素导致的风险：诸如地震、火灾、水灾、战争等不可抗力因素可能导致xswap交易系统的瘫痪；xswap无法控制和不可预测的系统故障、设备故障、通讯故障、电力故障等也可能导致xswap交易系统非正常运行甚至瘫痪，这些都会使用户的交易委托无法成交或者无法全部成交，用户将不得不承担由此导致的损失。
（五）数字资产市场风险：
（1）数字资产本身不由任何金融机构或平台发行，数字资产市场是全新的、未经确认的，且可能不会带来实际收益增长的市场；
（2）数字资产市场崩溃；
（3）用户的数字资产钱包私钥失密、用户的数字资产钱包被黑客攻击或被第三方盗窃；
（4）用户所持有的数字资产遭受算力攻击而导致资产数额变动等；
（5）用户在转入/转出数字资产时填写错误的地址或未进行转账备注而导致的数字资产遗失；
（6）用户在买卖数字资产前未履行审慎义务导致其银行账号被监管机构冻结、查封；
（7）用户所持有的数字资产发行方倒闭而导致用户持有的数字资产贬值。
（六）其他风险：
（1）由于用户的过错导致的任何损失，包括：密码失密、操作不当、交易决策失误、遗忘或泄露密码、密码被他人破解、用户使用的计算机系统被第三方侵入、用户委托第三人代理交易时第三人恶意或不当操作而造成的损失等原因可能会使用户发生账户保证金亏损，该损失将由用户自行承担；
在用户进行交易中他人给予用户的保证获利或不会发生账户保证金亏损的任何承诺都是没有根据的，类似的承诺不会减少用户发生账户保证金亏损的可能。
（2）网上交易、热键操作完毕，未及时退出，他人进行恶意操作而造成的损失；其中xswap交易未及时退出还可能遭遇黑客攻击，从而造成损失。
xswap交易市场有极高风险，并不适合绝大部分人士参与交易。用户知悉并了解此投资有可能导致部分损失或全部损失，所以用户应当以能承受的损失程度来决定其投入的保证金额度。除了本协议第八条提示的风险外，还会有未能预测的风险存在。用户应慎重评估自己的财政状况，及各项风险，而做出任何xswap交易的决定。用户应当承担由该决定产生的全部损失，xswap对用户的交易决定不承担任何责任。


特别提示：
本风险提示书的揭示事项仅为列举性质，未能详尽列明用户参与交易所面临的全部风险和可能导致用户交易损失的所有因素。
用户应慎重评估自己的财政状况，及各项风险，而做出任何交易的决定。用户应当承担由该决定产生的全部损失，xswap对用户的投资或交易决定不承担任何责任。
用户在首次开始xswap交易前，应认真阅读并理解相关业务规则及本风险提示书的全部内容。
用户签署本风险提示书，表明用户已经理解并愿意自行承担参与xswap交易的风险和损失。
附件2：
了解你的客户与反欺诈、反洗钱条款

公布日期：2019年  月  日   
                                             生效日期：2019年  月  日 


一、导言
1.1本平台保证审慎遵守“了解你的客户”和反欺诈、反洗钱相关的法律法规且不得故意违反该《了解你的客户与反欺诈、反洗钱条款》。在本平台合理控制的范围内本平台将采取必要的措施和技术为您提供安全的服务，尽可能使您免于遭受犯罪嫌疑人的洗钱行为带来的损失。
1.2本平台的了解你的客户与反欺诈、反洗钱政策是一个综合性的国际政策体系，包括您隶属的不同法律辖区的了解你的客户与反欺诈、反洗钱政策。本平台健全合规的框架确保本平台在本地和全球层面均符合监管要求和监管水平，并确保本网站持续性运行。

了解你的客户和反欺诈、反洗钱政策如下：
2.1颁布了解你的客户和反洗钱政策并时时更新以满足相应的法律法规规定的标准；
2.2颁布和更新运行本网站的一些指导原则和规则，且本平台的员工将按照该原则和规则的指导提供服务；
2.3 设计并完成内部监测和控制交易的程序，如以严格的手段验证身份，安排组建专业团队专门负责反洗钱工作；
2.4 采用风险预防的方法对客户进行尽职调查和持续的监督;
2.5 采用系统和人工相结合的方式，审查和定期检查已发生的交易，如用户给在一定时间内进行高频实盘交易，经平台认定属于异常交易的;
2.6 向主管当局提交大额交易和可疑交易报告;
2.7身份证明文件、地址证明文件、用户的实盘交易活动数据资料将被妥善记录并保存，并对备份数据文件定期检查、随机抽查。保存期限将会维持至少五年，如被提交给监管部门，恕不另行通知您。
2.8 整个交易过程中，信用卡被禁止使用。

三、身份信息与核实确认
3.1 身份信息
3.1.1 根据不同的司法管辖区的不同规定及不同的实体类型，本平台收集的您的信息内容可能不一致，原则上将向注册的个人收集以下信息：
个人基本信息：您的姓名，住址（及永久地址，如果不同） ，出生日期及国籍等可获得的其他情况。身份验证应该是根据官方或其他类似权威机构发放的文件，比如护照，身份证或其他不同的辖区要求的和引发的身份证明文件。您提供的地址将使用适当的方法进行验证，比如检查乘用交通工具的票据或利率票据或检查选民登记册等。
有效的照片：在您注册之前，您须提供您将您的身份证件放在胸前的照片；
联系方式：电话/手机号码和/或有效的电子邮件地址。
3.1.2如果您是一个公司或其他合法实体，本平台将收集以下信息以确定您或信托帐户的最终受益人。
公司注册、登记证；公司的章程与备忘录副本；公司的股权机构和所有权说明的详细证明材料，证明决定本网站账户的开立以及执行的授权委托人的董事会决议；按照要求需要提供的公司董事、大股东及本网站账户有权签字人的身份证明文件；该公司的主要营业地址，如果与公司的邮寄地址不同，提供邮寄地址。如果公司在本地的地址与它的主要营业地址不一致的，则被视为风险较高的客户，需要提交额外附加文件。
根据不同的司法管辖区的不同规定及不同的实体类型，本平台要求的其他认证和权威部门发布的文件以及本平台认为必要的文件。
3.1.3 本平台只接受英语版本或汉语版本的身份信息，如不是，请您将您的身份信息翻译成英文的版本并加以公证。
3.2确认核实
3.2.1本平台要求您提供身份证明文件的全部页面内容。
3.2.2 本平台要求您提供您将您的身份证明文件放在您胸前的照片。
3.2.3证明文件的副本一般应核和原始凭证进行核对。然而，如果某个可信赖的合适的认证人可证明该副本文件是原始文件准确而全面的复制的，该副本可接受。这样的认证人包括大使、司法委员、地方治安官等。
3.2.4 对识别最终受益人和账户控制权的要求是确定哪些个人最终所有或控制直接客户，和/或确定正在进行的交易是由他人代为执行。如果是企业，则大股东的身份（例如那些持有10％或以上的投票权益）应被验证。一般，持股25 ％会被认定为正常风险内，其股东身份须验证；持股10%或拥有更多的投票权或股票时被认定为高风险的情况，股东身份须加以验证。

四、监控交易
4.1 本平台根据安全性和实际交易情况时时设置和调整日常交易和保证金出入金最高限额;
4.2如果交易频繁集中发生在某个注册用户或存在超乎合理的情况，本平台的专业团队将评估并决定他们是否可疑;
4.3本平台凭借自身的判断认定为可疑交易的情况，本平台可能会采取暂停该交易、拒绝该交易等限制性措施，甚至如果可能将尽快逆转该交易，同时向主管部门报告，但不会通知您;
4.4本平台保留拒绝来自于不符合国际反洗钱标准辖区的人或可被视为政治公众人物的人的注册申请，本平台保留随时暂停或终止根据本平台自身判断为可疑交易的交易，但本平台这样做并不违反对您的任何义务和责任。

五、处理方式
5.1本平台发现用户有欺诈行为或其他损害本平台、第三方或其他用户利益的情形，将立即依法公告并且中止该用户在平台网站及移动互联网客户端的一切活动（包括但不限于参与实时聊天、保证金出入金、参与交易等）。对于情节严重、涉案金额较大的情形，本平台有权移送有管辖权的监管机构处理。
5.2本平台有权在网站及移动客户端的消息中心及用户交流群内披露欺诈及疑似欺诈案例，同时拒绝或终止相关用户的一切活动，用户对此明知且无异议。

`
export default str
