const str = `
### 隐私政策

公布日期：2019年  月  日   
生效日期：2019年  月  日

目录：    
一、本隐私政策的管辖法律和适用范围     
二、我们如何收集和使用您的个人信息    
三、我们如何存储您的个人信息    
四、我们如何共享、转让您的个人信息    
五、我们如何保护您的个人信息    
六、您管理您个人信息的权利    
七、对第三方责任的声明    
八、本隐私政策的更新及如何联系我们    


xswap（“我们”）注重保护用户个人信息及个人隐私。本隐私政策包含我们收集、处理、存储、使用、共、转让、公开披露和保护用户（“您”）的个人信息（以下或称“信息”）的有关条款。，我们将按照本隐私权政策（“本政策”）收集、使用及共享您的个人信息。同时，我们会通过本文本向您说明，与您协商确认，我们如何为您提供访问、更新、控制和保护您信息的服务。
请您在使用我们的服务前，仔细阅读和了解本隐私政策，以帮助您了解维护自己隐私权的方式。如果您对本隐私政策有任何疑问，您可以通过我们公布的联系方式与我们联系。如果您不同意本隐私政策的任何内容，您应立即停止使用我们的服务。当您使用我们提供的任一服务时，即表示您已经同意我们按照本隐私政策来收集、处理、存储、使用、共享、转让、公开披露和保护您的个人信息。
为了让您可以正常使用我们的服务，我们需要按照相关法规要求进行实名制管理、履行反洗钱职责、采取风险防范措施。收集、存储、使用、共享您的信息，是出于遵守国家法律法规的规定、向您提供服务及提升服务质量、避免我们无法及时与您取得联系而产生对您不利的影响，以更好地保护您的账户安全的需要。

一、本隐私政策的管辖法律和适用范围
（一）本隐私政策的管辖法律
本隐私政策依照塞舌尔法律制定和解释，适用塞舌尔法律并仅受塞舌尔法律管辖。
本隐私政策所称塞舌尔法律，指塞舌尔的立法机关或政府机构不时颁布的法律、法规、规章、规范性文件、以及其他形式的监管规定或政府命令。

（二）本隐私政策的适用范围

本隐私政策适用于xswap提供的所有服务（以下简称“服务”或“我们的服务”），您访问xswap网站和使用xswap提供的服务，均适用本隐私政策。

本隐私政策所称“xswap网站”包括但不限于xswap网（当前网址为www.xswap.io，如果将来我们变更网址或增加其他网址，请以届时的网址为准）、xswap网对应的移动客户端（当前名称为xswap App，如果将来我们变更移动客户端的名称或增加新的移动客户端，请以届时的情形为准）或其他互联网媒介等。

我们所有的服务均适用本隐私政策。
本隐私政策不适用于通过我们的服务而接入的其他第三方产品或服务（“第三方”，包括但不限于您的交易相对方、任何第三方网站以及第三方服务提供者）收集的信息。我们对第三方使用您个人信息的行为及后果不承担任何责任。请您注意，第三方可能有自己的隐私政策，您需要仔细阅读其政策内容。当您查看第三方创建的网页或使用第三方开发的应用程序时，可能会发现该网页或应用程序放置的Cookie或像素标签。这些Cookie或像素标签不受我们的控制，而且它们的使用不受本隐私政策的约束。

二、我们如何收集和使用您的个人信息
个人信息是指以电子或其他方式记录的能够单独或与其他信息结合识别特定自然人身份或反映特定自然人活动情况的各种信息。

我们仅会出于本隐私政策所述的以下目的，收集和使用您的个人信息：

（一）我们在您注册xswap账号过程中可能收集的您的个人信息

1、通过注册账号直接收集的信息

在您使用我们的服务前，您需要注册xswap账号以成为我们的用户。为账号注册之目的，您需要按照相关网络页面的提示向我们提供用于识别您身份的信息。

您可以通过在相关网络页面输入您本人名下的实名制手机号并回填我们发送给您的验证码进行注册（为此您必须保证该手机号已经以您本人名义在相应电信服务商处进行了实名登记、并且该手机号正在由您本人使用），您也可通过第三方账号进行注册（通过第三方账号进行注册的介绍详见下文）。

如果您未注册xswap账号，将导致您不能成为我们的用户，但这并不会导致我们禁止您访问xswap网站并使用基本的浏览或信息搜索功能。然而，在任何情形下，您都充分理解并完全同意，我们无意且不应被认定为向任何未注册xswap账号的对象提供任何服务或与之建立任何商业关系。

在您注册xswap账号之后，您可以进一步通过相关网络页面上传您的用户头像（头像可以是不包含违法内容的卡通形象或其他图片，我们并不要求您必须上传您的本人照片）、或向我们进一步提供您的性别、居住地、个人简介等信息（具体以相关网络页面的提示和实际情况为准），这些信息可能有助于我们向您提供更加个性化的服务，但拒绝提供这些信息不会影响您使用我们的服务的基本功能。


（二）我们在您使用我们的服务的过程中可能收集的您的个人信息

为了遵守法律的规定、以及为了向您提供服务并保障您的账号安全与系统运行安全，我们会收集您在使用我们的服务的过程中产生的相关信息，包括：

1.实名认证信息

在您未完成实名认证的情形下，您不能且不应使用我们提供的数字资产充值提款、领取新手礼物、领取红包等服务。如果您需要使用前述服务，您必须先按照相关网络页面的提示向我们提供相应信息以完成实名认证。

2.设备信息

当您使用我们的服务时，我们会自动收集并记录您的设备信息，包括但不限于设备型号、唯一设备标识符、操作系统、分辨率、电信运营商等软硬件信息等。

3.网络日志信息

当您使用我们的服务时，我们会自动收集您使用我们服务的详细情况，并作为有关的网络日志保存，包括但不限于您的IP地址、设备型号、操作系统的版本、浏览器的类型、使用的语言、访问的日期和时间、您使用xswap网站的记录等信息。

4.移动设备定位信息

为了更好地向您推荐本地资讯、以及更好地向您匹配我们不时提供的其他服务（如有），我们会获取您的移动设备定位信息（以下简称“定位功能”）。为了保护您的隐私，定位功能仅被应用于我们的移动客户端、并且定位功能在默认状态下是被置为关闭状态的。当且仅当您在您的移动设备上安装并首次打开我们的移动客户端时，我们会通过特定的页面向您事先说明开启定位功能的目的、并仅在您作出同意的意思表示的情形下才会开启定位功能和获取您的移动设备位置信息。如果您作出了拒绝开启定位功能的意思表示，我们不会再主动向您请求开启定位功能。

当然，您也可以在任何时候在您的移动设备上进行操作以便自行关闭或自行开启定位功能。一般而言，您可以在您的移动设备的操作系统的设置功能中进行相应操作，但具体方法建议您参考或联系您的移动设备的服务商或生产商，一旦您通过系统授权关闭定位功能，您将无法使用我们基于定位功能为您提供的服务，或无法达到相关服务的预期效果。

您的数字资产钱包地址，以及历史累计数字资产充值提款记录

账户交易信息
包括您的账户和全部合约持仓的详细信息，例如实时和历史委托、交易价格和仓位以及保证金余额。

7.您在平台全部实时聊天窗口（IM）中发布的消息的内容和详细信息（例如日期），或您发送给我们的消息（例如客户服务、工单、投诉建议等）

（三）个性化服务信息收集

为提升您的服务体验及改进服务质量，或为防范风险及为您推荐更优质或更适合的服务，我们会收集您使用平台服务时的记录，收集您与客户服务团队联系时提供的信息，收集您参与问卷调查时向我们发送的问卷答复信息，及您使用的服务方式、使用服务时的操作信息以及有关您曾使用的移动客户端（APP）和其他软件的信息；还会向第三方机构（包括但不限于征信机构、商户等）留存您的行为信息、交易信息。我们会对这些信息进行统计、分析，为您提供更加准确、个性、流畅及便捷的服务。为了提升处理效率，降低处理成本，或提高处理准确性，我们可能会委托第三方机构来为我们提供这方面服务，但我们会要求该公司遵守严格的保密义务及采取有效的保密措施，禁止其将这些信息用于未经您授权的用途。

（四）其他用途

在不违反塞舌尔法律的前提下，我们可能会将您的个人信息在匿名化、汇总、脱敏和加密处理后，形成统计信息或用户画像（但画像无法识别任何用户个人），为您展示和推送相关服务、产品或功能，或用于其他合法且正当的商业用途。

三、我们如何存储您的个人信息
我们会将您与本隐私政策有关的全部信息存储于我们位于全球的服务器内，存储期限为5年。

四、我们如何共享、转让、公开披露您的个人信息
（一）共享
我们不会与任何公司、组织和个人共享您的个人信息，但以下情况除外：
1、事先获得您明确的同意或授权；
2、基于法定情形：根据法律规定、诉讼等争议解决需要，司法机关或政府机构等依法提出的要求；
3、与关联方共享：为向您提供更好的服务，我们可能与我们的关联公司共享您的个人信息。但我们仅共享必要的个人信息，且关联公司对您的个人信息的处理和保护亦须受本隐私政策的约束。关联公司如要改变您的个人信息的处理目的，将再次征求您的授权和同意；
4、基于协议约定：依据您与我们签署的相关协议(包括在线签署的电子协议及相关规则)或其他法律文件，有必要向第三方共享时；
5、基于合理商业习惯：例如与第三方共享联合营销活动中的中奖信息，以便第三方能及时向您发放奖品；或在我们计划进行资本市场活动(包括但不限于IPO、债券发行等)接受尽职调查时等；
6、基于学术研究：例如为科研机构开展统计或学术研究之必要；
7、基于符合法律法规的社会公共利益等。

除非获得您的明确授权和同意，否则我们不会与第三方广告商、应用程序开发者、开放平台或其他合作伙伴共享您的个人信息。我们可能会为这些合作伙伴提供汇总后的信息、匿名化后的信息或其他不会识别到您个人身份的信息。

仅为实现本隐私政策中声明的目的，我们可能会与我们的合作方（包括供应商、服务提供商、顾问或代理人等）共享您的个人信息，以提供更好的客户服务和用户体验。这些合作方可能为我们提供技术基础设施服务，分析我们服务的使用方式，衡量广告和服务的有效性，提供客户服务和支付服务，进行学术研究和调查，或提供法律、财务与技术顾问服务。

请您知悉，即使已经取得您的授权同意，我们也仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并尽量对共享内容中的个人信息进行去标识化处理。对我们与之共享您的个人信息的公司、组织和个人，我们会与其签署严格的数据保护协定，要求其按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施妥善保护和处理您的个人信息。

（二）转让

我们不会将您的个人信息转让给其他任何公司、组织和个人，但以下情形除外：

随着我们业务的发展，我们及我们的关联公司有可能进行合并、收购、资产转让或其他类似的交易。如相关交易涉及到您的个人信息转让，我们会要求新持有您个人信息的公司、组织和个人继续受本隐私政策的约束，否则我们将要求该公司、组织和个人重新征得您的授权同意。

在获得您明确同意的情形下转让，亦即获得您明确同意后，我们会向其他方转让我们已经获取的您的个人信息。

我们如何保护您的个人信息

（一）数据安全措施
为保障您的信息安全，我们努力采取各种符合业界标准的物理、电子和管理方面的安全措施来保护您的个人信息，防止您的个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们将尽力采取一切合理可行的措施，保护您的个人信息。例如在您的浏览器与“服务”之间交换数据时采用SSL加密保护技术；同时对网站本身提供https安全浏览方式；使用加密技术确保数据的保密性；使用受信赖的保护机制防止数据遭到恶意攻击；部署访问控制机制，确保只有授权人员才可访问个人信息；以及举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。

请注意，无法与任何特定个人直接建立联系的数据，不属于个人信息。如果我们将这类非个人信息与其他信息结合用于识别自然人个人身份，或将其与个人信息结合使用，则在结合使用期间，此类信息将被视为个人信息。

（二）账号安全

互联网并非绝对安全的环境，我们强烈建议您通过安全方式、使用复杂密码，协助我们保证您的账号安全。如果您发现自己的个人信息泄密，尤其是您的账号密码发生泄露，请您立即根据本隐私政策中提供的联系方式联络我们，以便我们采取相应措施。

（三）个人信息安全事件处置

在不幸发生个人信息安全事件后，我们将按照塞舌尔法律的规定，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。

六、您管理您个人信息的权利
我们保障您对自己的个人信息行使以下权利：

（一）访问和编辑您的个人信息

您有权访问和编辑您的个人信息，法律规定的例外情况除外。如果您想行使数据访问和编辑的权利，可以通过以下方式自行访问和编辑：

1、账号信息：如果您希望访问或编辑您的账号中的个人资料信息、更改您的密码、添加安全信息或其他相关信息(以下统称“账号信息”)，您可以在网页或移动客户端（在登录状态下点击您的头像和通过“设置”功能）执行此类操作；
2、留言或回复信息：如果您希望访问或编辑您的留言或回复信息，您可以在网页或移动客户端中找到您的相应的留言或回复信息，并相应的信息页面执行此类操作；
3、聊天信息：如果您希望访问您的聊天信息，您可以在网页或移动客户端中找到您的相应的聊天信息，并相应的页面内执行访问操作，但请您知悉和理解，聊天信息一旦发送成功将无法再次被编辑；

如果您无法通过上述内容访问或编辑您的上述个人信息，您可以随时联系我们的在线客服，我们将尽快回复您并尽可能向您提供指导。

（二）删除您的个人信息

您可以通过“（一）访问和编辑您的个人信息”中允许的方式删除您的部分个人信息。

在以下情形中，您可以向我们提出删除个人信息的请求：

1、如果我们处理个人信息的行为违反有权您国籍所述国家法律。 例如，在欧洲，您可向您居住、工作或您认为可能发生违规之地在的数据保护机构进行投诉成功以后；
2、如果您不再使用我们的产品或服务，或您主动注销了账号；
3、如果我们不再为您提供服务。

（三）改变您授权同意的范围或撤回授权

每个业务功能需要一些基本的个人信息才能得以完成（见本隐私政策“第二条”）。您可以通过“（一）访问和编辑您的个人信息”中允许的方式删除信息、更改隐私设置、以及在浏览器或您的移动设备操作系统中关闭相关功能等方式改变同意范围或撤回您的授权。但请您理解，当您执行上述操作后，我们将无法继续为您提供撤回同意或授权所对应的服务，也将不再处理相应的个人信息。但您撤回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。

（五）注销账号

您有权注销您的xswap账号。您可以通过我们的在线客服以及我们不时提供的其他方式（如有）与我们取得联系。

在您主动注销账号之后，我们将停止为您提供服务。

（六）约束信息系统自动决策

在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。

（七）响应您的上述请求

为了保障您的账号及个人信息安全，在涉及部分请求（如注销账号等）时，我们可能需要您提供相应方式证明您的身份和请求的正当性，我们将在收到您反馈并验证您的身份后的30天内答复您的请求。

对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。

对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或非常不切实际的请求，我们可能会予以拒绝。

七、对第三方责任的声明
请您注意，您访问的第三方网站经营者、通过我们接入的第三方服务（如xswap APP中第三方提供的服务）和由xswap处接收您的个人信息的第三方可能有自己的隐私权保护政策；当您查看第三方创建的网页或使用第三方开发的应用程序时，这些第三方可能会放置他们自己的Cookie或像素标签，这些Cookie或标签不受我们的控制，且它们的使用不受本政策的约束。我们会尽商业上的合理努力去要求这些主体对您的个人信息采取保护措施，但我们无法保证这些主体一定会按照我们的要求采取保护措施，请您与他们直接联系以获得关于他们的隐私政策的详细情况。如果您发现这些第三方创建的网页或第三方开发的应用程序存在风险时，建议您终止相关操作以保护您的合法权益。

八、本隐私政策的更新及如何联系我们
为给您提供更好的服务，我们的业务可能不时发生变化，本隐私政策也将随之调整。未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在xswap网站及xswap APP发出更新版本或以其他方式提醒您相关内容的更新，也请您访问xswap网站和xswap APP以便及时了解最新的隐私政策。在前述情况下，如果您不同意最新的隐私政策，您有权立即停止使用我们提供的服务。如果您继续使用我们的服务，即表示同意接受修订后的本隐私政策并受之约束。

如果您对于我们的个人信息处理行为存在任何投诉举报需求，您可以通过我们的在线客服以及我们不时提供的其他方式（如有）与我们取得联系并作充分描述，我们将在验证您身份后的30天内答复您的请求并尽力解决。

如果您对我们的回复不满意，特别是认为我们的个人信息处理行为损害了您的合法权益，您同意，由swap所在地有管辖权的机构对任何由本协议引起或与本协议相关的索赔或诉讼进行仲裁。

`
export default str
